src/SSL.Chat2Desk/src/Enums/C2D_ТипыЭлементовГрафическихСхем/C2D_ТипыЭлементовГрафическихСхем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>C2D_ТипыЭлементовГрафическихСхем</name>
  <enumValues>
    <name>Декорация</name>
  </enumValues>
  <enumValues>
    <name>Линия</name>
  </enumValues>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Завершение</name>
  </enumValues>
  <enumValues>
    <name>Условие</name>
  </enumValues>
  <enumValues>
    <name>Действие</name>
  </enumValues>
  <enumValues>
    <name>ВыборВарианта</name>
  </enumValues>
  <enumValues>
    <name>Разделение</name>
  </enumValues>
  <enumValues>
    <name>Слияние</name>
  </enumValues>
  <enumValues>
    <name>ТочкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ВложенныйБизнесПроцесс</name>
  </enumValues>
</mdclass:Enum>

src/SSL.Chat2Desk/src/CommonModules/C2D_РаботаСГрафическимиСхемамиПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс
Функция ПолучитьТипЭлементаПоИндексу(Индекс) Экспорт
	
	// значения itemType
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(0, Перечисления.C2D_ТипыЭлементовГрафическихСхем.Декорация);
	Результат.Вставить(1, Перечисления.C2D_ТипыЭлементовГрафическихСхем.Линия);
	Результат.Вставить(2, Перечисления.C2D_ТипыЭлементовГрафическихСхем.Старт);
	Результат.Вставить(3, Перечисления.C2D_ТипыЭлементовГрафическихСхем.Завершение);
	Результат.Вставить(4, Перечисления.C2D_ТипыЭлементовГрафическихСхем.Условие);
	Результат.Вставить(5, Перечисления.C2D_ТипыЭлементовГрафическихСхем.Действие);
	Результат.Вставить(6, Перечисления.C2D_ТипыЭлементовГрафическихСхем.ВыборВарианта);
	Результат.Вставить(7, Перечисления.C2D_ТипыЭлементовГрафическихСхем.Разделение);
	Результат.Вставить(8, Перечисления.C2D_ТипыЭлементовГрафическихСхем.Слияние);
	Результат.Вставить(9, Перечисления.C2D_ТипыЭлементовГрафическихСхем.ТочкаОбработки);
	Результат.Вставить(10, Перечисления.C2D_ТипыЭлементовГрафическихСхем.ВложенныйБизнесПроцесс);
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти
